"""
1.	Доработать паука в имеющемся проекте, чтобы он складывал все записи в БД (любую)
и формировал item по структуре:
●	наименование вакансии;
●	зарплата от;
●	зарплата до;
●	ссылка на саму вакансию;
●	сайт, откуда собрана вакансия.
2.	Создать в имеющемся проекте второго паука по сбору вакансий с сайта superjob. Паук должен формировать
item по аналогичной структуре и складывать данные в БД.

Дополнительно:
Перевести всех пауков сбора данных о вакансиях на ItemLoader и привести к единой структуре.
Сайт можно взять и любой друго й (интернет-магазин или сайт с объявлениями отсюда). Главное, чтобы
по get-запросу вам возвращалась нужная информация.
"""